Documents/ОценкаЛишнихРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОценкаЛишнихРасходов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛишниеРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПредварительныйРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛишниеРасходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Расходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Расходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоНоменклатурыЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КатегорияРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЛишниеРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ЛишниеРасходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КатегорияРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ОценкаЛишнихРасходов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует объект значениями по умолчанию
//
// Параметры:
//  Объект - ДокументОбъект.ОценкаЛишнихРасходов, ДанныеФормыСтруктура -
Процедура ЗаполнитьНовыйОбъект(Объект) Экспорт
	Объект.Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

// Обработчик заполнения списка текущих дел
// Параметры:
//   ТекущиеДела - см. ТекущиеДелаСервер.ТекущиеДела.
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	Если Не ПравоДоступа("Редактирование", Метаданные.Документы.ОценкаЛишнихРасходов) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходыОбороты.Период КАК Период
		|ИЗ
		|	РегистрНакопления.Расходы.Обороты(, &КонецПрошлогоМесяца, Месяц, ) КАК РасходыОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЛишниеРасходы.Обороты(, , Месяц, ) КАК ЛишниеРасходыОбороты
		|		ПО РасходыОбороты.Период = ЛишниеРасходыОбороты.Период
		|ГДЕ
		|	ЛишниеРасходыОбороты.Период ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	РасходыОбороты.Период";
	
	Запрос.УстановитьПараметр("КонецПрошлогоМесяца", НачалоМесяца(ТекущаяДатаСеанса()) - 1);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	НезаполненныеПериоды = РезультатЗапроса[0].Выгрузить().ВыгрузитьКолонку("Период");
	
	ГруппаДел = ТекущиеДела.Добавить();
	ГруппаДел.Владелец = Метаданные.Подсистемы.ДоходыРасходы;
	ГруппаДел.Идентификатор = "ОценкаЛишнихРасходов_НеСозданные";
	ГруппаДел.ЕстьДела = (НезаполненныеПериоды.Количество() > 0);
	ГруппаДел.Представление = НСтр("ru='Не созданы оценки лишних расходов'");
	
	Для Каждого Период Из НезаполненныеПериоды Цикл
		Дело = ТекущиеДела.Добавить();
		Дело.Владелец = ГруппаДел.Идентификатор;
		Дело.Идентификатор = "ОценкаЛишнихРасходов_НеСозданные_" + Формат(Период, НСтр("ru = 'ДФ=yyyyMM'"));
		Дело.ЕстьДела = Истина;
		Дело.СкрыватьВНастройках = Истина;
		Дело.Представление = Формат(Период, НСтр("ru = 'ДФ=''MMMM yyyy'''"));
		
		Дело.Форма = "Документ.ОценкаЛишнихРасходов.ФормаОбъекта";
		Дело.ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Месяц", Период));
	КонецЦикла;
КонецПроцедуры

// Добавляет команды отчетов для данного документа
//
// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	Отчеты.ЛишниеРасходы.ДобавитьКомандуОтчета(КомандыОтчетов);
КонецПроцедуры

// Формирует наборы движений по регистрам для переданного документа
//
// Параметры:
//  Ссылка - ДокументСсылка.ОценкаЛишнихРасходов -
//
// Возвращаемое значение:
//  Структура - Ключ структуры соответствует имени регистра.
//              Значение каждого свойства - ТаблицаЗначений с движениями по регистру
Функция ДанныеДляПроведенияДокумента(Ссылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОценкаЛишнихРасходов.Месяц КАК Период,
		|	ОценкаЛишнихРасходовЛишниеРасходы.КатегорияРасходов КАК КатегорияРасходов,
		|	ОценкаЛишнихРасходовЛишниеРасходы.Номенклатура КАК Номенклатура,
		|	ОценкаЛишнихРасходовЛишниеРасходы.СтатьяРасходов КАК СтатьяРасходов,
		|	ОценкаЛишнихРасходовЛишниеРасходы.Сумма КАК Сумма
		|ИЗ
		|	Документ.ОценкаЛишнихРасходов.ЛишниеРасходы КАК ОценкаЛишнихРасходовЛишниеРасходы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОценкаЛишнихРасходов КАК ОценкаЛишнихРасходов
		|		ПО ОценкаЛишнихРасходовЛишниеРасходы.Ссылка = ОценкаЛишнихРасходов.Ссылка
		|ГДЕ
		|	ОценкаЛишнихРасходовЛишниеРасходы.Ссылка = &Ссылка
		|	И ОценкаЛишнихРасходовЛишниеРасходы.Пометка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Новый Структура("ЛишниеРасходы", РезультатЗапроса.Выгрузить());
КонецФункции

#КонецОбласти

#КонецЕсли
